aerogluMU/STM32F469I-DISCO-LFT-SCREEN/Core/Src/main.c
}

/* USER CODE BEGIN 4 */

/*********************************************************************
 * @fn      		  - HAL_UART_RxCpltCallback
 *
 * @brief             - This function called when USART6 RX Interrupts end.
 *
 * @param[in]         - Handle structure of UART
 *
 * @return            - none
 *
 * @Note              - none
 */

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	// Set USART6 RX flag 1
	RxBuffer[count++]=RxData;

	// Check data is end or not
	for(uint32_t i = 0;i<strlen(RxBuffer);i++){
		if(RxBuffer[i-1]==13 && RxBuffer[i]==10){
			// if data has "\r" or "\n" increase cnt
			lftflg.uart6_lnend_flag++;
		}
		if(i == (strlen(RxBuffer)-1)){
			if(lftflg.uart6_lnend_flag == 1){
				// if cnt is equal to 2
				// set uart6_rx_flag
				lftflg.uart6_rx_flag = 1;

				// set count is 0
				count = 0;

				// delete "\r" and "\n" from RxBuffer
				RxBuffer[i] = '\0';
				RxBuffer[i-1] = '\0';
			}
		}
	}

	// Check data has 817 or 818 or not
	for(uint32_t i = 0;i<strlen(RxBuffer);i++){
		if(RxBuffer[i]=='7' && RxBuffer[i-1]=='1' && RxBuffer[i-2]=='8'){
			// if data has 817 set uart6_doors_flag
			lftflg.uart6_doors_flag = 1;
		}
		if(RxBuffer[i]=='8' && RxBuffer[i-1]=='1' && RxBuffer[i-2]=='8'){
			// if data has 818 reset uart6_doors_flag
			lftflg.uart6_doors_flag = 0;
		}
	}

	// Reset cnt for checking data is end or not
	lftflg.uart6_lnend_flag = 0;

	//Call USART6 RX Interrupt
	if(UART_Start_Receive_IT(&huart6, (uint8_t*)&RxData, 1) != HAL_OK){
	  Error_Handler();
	}
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
